{
    
    "indexOf": {
        "title": "How to use: indexOf",
        "description": "Litle guide on the usage of indexOf method",
        "content": "I had this problem: I had an array of objects that i wanted to list, that was okay, i made the array and iterated over it. The page then listed the objects fine and well. I then wanted to use the array key as an url adress. There must be easyer ways to get the key but i got the key by using the indexOf method. To use the indexOf method you first have to select the array you want to get the index of a key in, then you have to use the method on it and give the parameter of the key name. array.indexOf(key), you then get the index back and your done."
  },
    "flexbox": {
        "title": "How to use: Flexbox",
        "description": "Flexbox is a part of the CSS vocabulary and a way to layout your site",
        "content": {
            "title": "Css Glossary",
            "glossary": {
                "module":[ "Module", "A css module is something tricky to understand. And maybe it isnt so important in learning flexbox, but lets try anyway. The official explanation is as follows: A CSS Module is a CSS file in which all class names and animation names are scoped locally by default." ],
                "container": ["Container", "Parent element, known as flex container."],
                "main axis": ["Main axis", "This is the shit"]
            },
            "paragraph": "Flexbox is about setting upp flexible boxes, on my page i have 4 boxes right now, or to be more spesific, i got one box with 3 boxes within. I got the site box with the navbox, bodybox and footer box"
            
        }
  },
    "objectToArray": {
        "title": "Making arrays out of objects",
        "description": "If you have an object, like JSON for example. You can use the Obcject.key to make an array",
        "content": "This is to tricky to explain now, put one day maybe"
  },
    "DocumentObjectModel": {
        "title": "How to use: THE DOM",
        "description": "To create interactivity to your website u can use JavaScript to manipulate the DOM, this blogpost tries to explain how we do that",
        "content": {
            "title": "DOM Glossary",
            "glossary": {
                "dom": ["DOM", "DOM stands for Document Object Model and it is a Javascript Model"]
            },
            "paragraph": ["Window Object", " dfsfsdfsfsdfdsf"]
        }
    }
    
}